---
kind: property
id: P:Autodesk.Revit.DB.LinePatternSegment.Length
zh: 长度
source: html/43eef68f-805f-3ea6-c28f-d6f83a055912.htm
---
# Autodesk.Revit.DB.LinePatternSegment.Length Property

**中文**: 长度

Gets and sets the length of the segment.

## Syntax (C#)
```csharp
public double Length { get; set; }
```